import 'package:flutter/material.dart';

class MySettingsPage extends StatelessWidget {
  final int id;

  MySettingsPage({required this.id});

  String getTextFromId(int id) {
    switch (id) {
      case 1:
        return "مرحبًا بك في OOH Live muslim، رفيقك الشامل لإثراء رحلتك الروحية. مهمتنا هي تعزيز المجتمع والروحانية وتبادل المعرفة بين المسلمين في جميع أنحاء العالم، وتقديم ميزات مثل الأذكار لليقظة الذهنية طوال اليوم، وتوقيت الصلاة الحية للبقاء على اتصال بجدول عبادتك، وميزة قرآنية شاملة لفهم أعمق، وحياة نابضة بالحياة. منصة مجتمعية للمشاركة في المناقشات والدعم. ملتزمًا بالأصالة والشمولية، يضمن فريقنا أعلى معايير جودة المحتوى. تواصل معنا للحصول على الدعم، وتابعنا على وسائل التواصل الاجتماعي للحصول على التحديثات، ونشكرك على اختيار OOH Live Islam كمرشدك الروحي الموثوق به.";
      case 2:
        return "فيما يلي تعليمات لاستخدام OOH Live muslim في فقرة واحدة:ة من OOH Live Islam، ابدأ بتنزيل التطبيق على جهازك المحمول. بمجرد التثبيت، استكشف ميزاته، بما في ذلك الأذكار، ومواعيد الصلاة المباشرة، وموارد القرآن، ومنصة المجتمع. قم بالوصول إلى الأذكار من خلال الانتقال إلى قسم الأذكار واختيار الأذكار المناسبة لأوقات مختلفة من اليوم. قم بتمكين خدمات الموقع لتلقي أوقات الصلاة المباشرة الدقيقة بناءً على موقعك. ميزة الغوص في القرآن للوصول إلى ترجمات وتفاسير وتلاوات القرآن الكريم. تفاعل مع المجتمع من خلال الانضمام إلى المناقشات وتبادل الأفكار وطلب التوجيه حول مواضيع مختلفة. للحصول على الدعم أو التعليقات، اتصل بفريق الدعم لدينا عبر البريد الإلكتروني أو رقم الهاتف المقدم. ابق على اطلاع من خلال متابعتنا على منصات التواصل الاجتماعي. ساعدنا في نشر الكلمة حول OOH Live Islam لدعم مهمتنا المتمثلة في إثراء الرحلة الروحية للمسلمين في جميع أنحاء العالم. شكرًا لك على اختيار OOH Live muslim كرفيقك الموثوق به.";
     case 3:
        return "Contact here : oohlivetv@gmail.com";
      case 4:
        return "تضمن سياسة الخصوصية الخاصة بنا في OOH Live Islam حماية معلوماتك الشخصية، التي يتم جمعها عند استخدام تطبيقنا، بما في ذلك البيانات مثل الاسم والبريد الإلكتروني والموقع وتفاصيل الجهاز، المستخدمة بشكل أساسي لتحسين خدماتنا واتصالاتنا. نحن لا نشارك معلوماتك من أجل الربح، ولكن قد نتعامل مع مقدمي خدمات موثوقين أو نكشف عن البيانات إذا كان ذلك مطلوبًا بموجب القانون. تم وضع إجراءات أمنية لحماية معلوماتك، على الرغم من أنه لا يمكن ضمان الأمان المطلق. OOH Live Islam ليس موجهًا للأطفال دون سن 13 عامًا، وسيتم تحديث أي تغييرات على سياسة الخصوصية الخاصة بنا على هذه الصفحة. للاستفسارات أو المخاوف، يرجى الاتصال بنا. باستخدام تطبيقنا، فإنك توافق على الشروط الموضحة في سياسة الخصوصية هذه.";
      case 5:
        return "يجب أن يكون عمرك 13 عامًا على الأقل حتى تتمكن من استخدام التطبيق. إن استخدامك للتطبيق هو على مسؤوليتك الخاصة، ونحن لسنا مسؤولين عن أي أضرار ناتجة عن استخدامك. أنت توافق على عدم استخدام التطبيق لأي غرض غير قانوني أو غير مصرح به والالتزام بجميع القوانين واللوائح المعمول بها. نحن نحتفظ بالحق في تعديل التطبيق أو إنهائه في أي وقت دون إشعار مسبق. إن استمرارك في استخدام التطبيق بعد إجراء أي تغييرات على شروط الاستخدام هذه يشكل موافقتك على الشروط المعدلة. أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك وعن جميع الأنشطة التي تحدث ضمن حسابك. أي انتهاك لهذه الشروط قد يؤدي إلى إنهاء حسابك.";
      case 6:
        return "نحن نقر بالثقة التي تضعها في OOH Live Islam ونحن ملتزمون بتوفير منصة قيمة وآمنة لرحلتك الروحية. دعمكم ومشاركتكم يثري مجتمعنا، ونحن نعرب عن امتناننا لمشاركتكم. نحن ندرك أهمية خصوصيتك ونلتزم بحماية معلوماتك الشخصية وفقًا لسياسة الخصوصية الخاصة بنا. باستخدام OOH Live مسلم، فإنك تقر وتوافق على شروط الاستخدام الخاصة بنا، والمبادئ التوجيهية التي تضمن بيئة آمنة ومحترمة لجميع المستخدمين. شكرًا لك على اختيار OOH Live muslim ليكون رفيقك على طريق الإيمان.";
      default:
        return "Invalid ID";
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(onPressed: ()
        {
          Navigator.pop(context);
        },icon:Icon(Icons.arrow_back_ios)),
        title: Text(''),
      ),
      
      body: SingleChildScrollView(
        
        child: Center(
          
          child: Padding(
            padding: const EdgeInsets.all(13.0),
            child: Column(
              mainAxisAlignment: MainAxisAlignment.center,
              crossAxisAlignment: CrossAxisAlignment.center,
              children: [
                Text(
                  getTextFromId(id),
                  style: TextStyle(fontSize: 15.0),
                  textAlign: TextAlign.center,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
